## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks-monitoring.azurerm_dashboard_grafana.aks_grafana has changed
  ~ resource "azurerm_dashboard_grafana" "aks_grafana" {
        id                                     = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/prvaks-monitoring-rg/providers/Microsoft.Dashboard/grafana/prvaks-grafana"
        name                                   = "prvaks-grafana"
        tags                                   = {
            "Environment" = "Dev"
            "Owner"       = "kmiszel"
            "Source"      = "Terraform"
        }
        # (12 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks["blue"].azurerm_kubernetes_cluster.akscluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "akscluster" {
        id                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/aztf-spoke-rg/providers/Microsoft.ContainerService/managedClusters/prvaks-blue"
        name                                = "prvaks-blue"
        tags                                = {
            "Environment" = "Dev"
            "Owner"       = "kmiszel"
            "Source"      = "Terraform"
        }
        # (37 unchanged attributes hidden)

      ~ default_node_pool {
          ~ auto_scaling_enabled          = true -> false
          - max_count                     = 3 -> null
          - min_count                     = 2 -> null
            name                          = "defaultpool"
            tags                          = {}
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.aks-monitoring.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.aks-monitoring.azurerm_role_assignment.role_monitoring_reader must be replaced
-/+ resource "azurerm_role_assignment" "role_monitoring_reader" {
      ~ id                                     = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleAssignments/08a818d8-3f40-a774-9198-18c8f342db10" -> (known after apply)
      ~ name                                   = "08a818d8-3f40-a774-9198-18c8f342db10" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply)
      ~ scope                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>